# vim: set ft=ruby:
# Brewfile/brew bundle documentation: https://github.com/Homebrew/homebrew-bundle

# Custom taps (brew tap)
tap "homebrew/cask"
tap "homebrew/cask-fonts" # Nerd Fonts: https://www.nerdfonts.com/

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Formulae (brew install)
brew "bat"
brew "bat-extras"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "gopass"
brew "jq"
brew "mas"
brew "pinentry-mac"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "zsh"

# Casks (brew install --cask)
cask "iterm2"
cask "github"

# Nerd Fonts: https://www.nerdfonts.com/
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"

# Powerline fonts: https://github.com/powerline/fonts
cask "font-anonymice-powerline", args: { require_sha: false }
cask "font-consolas-for-powerline", args: { require_sha: false }
cask "font-dejavu-sans-mono-for-powerline", args: { require_sha: false }
cask "font-delugia-mono-powerline"
cask "font-delugia-powerline"
cask "font-droid-sans-mono-for-powerline", args: { require_sha: false }
cask "font-fira-mono-for-powerline", args: { require_sha: false }
cask "font-inconsolata-dz-for-powerline", args: { require_sha: false }
cask "font-inconsolata-for-powerline", args: { require_sha: false }
cask "font-inconsolata-for-powerline-bold", args: { require_sha: false }
cask "font-inconsolata-g-for-powerline", args: { require_sha: false }
cask "font-liberation-mono-for-powerline", args: { require_sha: false }
cask "font-menlo-for-powerline", args: { require_sha: false }
cask "font-monofur-for-powerline", args: { require_sha: false }
cask "font-noto-mono-for-powerline", args: { require_sha: false }
cask "font-powerline-symbols", args: { require_sha: false }
cask "font-roboto-mono-for-powerline", args: { require_sha: false }
cask "font-sf-mono-for-powerline", args: { require_sha: false }
cask "font-source-code-pro-for-powerline", args: { require_sha: false }
cask "font-ubuntu-mono-derivative-powerline", args: { require_sha: false }

# Mac App Store Apps (mas install)

# Whalebrew containerized apps (whalebrew install)
