# vim: set filetype=ruby:
{{/* vim: set filetype=ruby.chezmoitmpl: */}}
# Brewfile/brew bundle documentation: https://github.com/Homebrew/homebrew-bundle

# Custom taps (brew tap)
{{ if .context.machine.personal -}}
tap "mistertea/et"
tap "twilio/brew"
{{ end -}}
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts" # Nerd Fonts: https://www.nerdfonts.com/
tap "homebrew/core"
tap "knqyf263/pet" # pet snippet manager
tap "romkatv/powerlevel10k"
tap "sidneys/homebrew"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Formulae (brew install)
{{ if .context.machine.personal -}}
brew "mistertea/et/et"
brew "twilio/brew/twilio"
{{ end -}}
brew "age"
brew "antidote"
brew "bat"
brew "bat-extras"
brew "bottom" # btm - like top, but... lower
brew "chezmoi"
brew "croc"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "ffuf"
brew "fzf"
brew "gawk"
brew "gdu", link: true, args: ["force"] # Fast disk usage reporter. Must force linking as a binary by the same name is provided by coreutils
brew "gh"
brew "git-delta"
brew "gnupg"
brew "go"
brew "gopass"
brew "hping"
brew "htop"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "lazygit" # Fancy terminal git client
brew "mas"
brew "miller" # mlr: nice tool for working with csv/tsv/json - fills some gaps jq has and is robust for non-json formats
brew "moreutils" # sponge, parallel
brew "mosh"
brew "mtr"
brew "naabu"
brew "ncdu"
brew "nmap"
brew "node"
brew "nuclei"
brew "nvm"
brew "openssh"
brew "pinentry-mac"
brew "pipx"
brew "pre-commit"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rclone"
brew "ripgrep"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "sevenzip"
brew "sipcalc"
brew "speedtest-cli"
brew "terraform"
brew "tflint"
brew "tmux"
brew "vim"
brew "virtualenv"
brew "watch"
brew "wget"
brew "ykman"
brew "yq"
brew "zoxide"
brew "zsh"

# Formulae (brew install) - explicit/fully qualified taps
brew "knqyf263/pet/pet"

# Casks (brew install --cask)
{{ if .context.machine.personal -}}
cask "balenaetcher"
cask "calibre"
cask "cryptomator"
cask "discord"
cask "handbrake"
cask "nheko"
cask "plex"
cask "signal"
cask "todoist"
cask "vlc"
{{ end -}}
{{ if .context.machine.work_managed -}}
{{ end -}}
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli", args: { appdir: "/Applications" }
cask "alfred", args: { appdir: "/Applications" }
cask "boop" # https://boop.okat.best/
cask "burp-suite-professional"
cask "clocker", args: { appdir: "/Applications" }
cask "docker" # Docker desktop
cask "firefox"
cask "github"
cask "google-chrome", args: { require_sha: false }
cask "iterm2"
cask "keybase"
cask "obsidian"
cask "setapp"
cask "visual-studio-code"
cask "wireshark"
cask "zed" # Zed editor
cask "zen-browser"

# Nerd Fonts: https://www.nerdfonts.com/
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

# Apple Fonts: https://developer.apple.com/fonts/
cask "font-new-york", args: { require_sha: false }
cask "font-sf-compact", args: { require_sha: false }
cask "font-sf-mono", args: { require_sha: false }
cask "font-sf-pro", args: { require_sha: false }

# Other Fonts
cask "font-inter" # https://rsms.me/inter/

# Mac App Store Apps (mas install)

# Whalebrew containerized apps (whalebrew install)
