# vim: set filetype=ruby:
{{/* vim: set filetype=ruby.chezmoitmpl: */}}
# Brewfile/brew bundle documentation: https://github.com/Homebrew/homebrew-bundle

# Custom taps (brew tap)
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts" # Nerd Fonts: https://www.nerdfonts.com/
tap "homebrew/core"
{{ if .context.machine.personal -}}
tap "mistertea/et"
{{ end -}}
tap "romkatv/powerlevel10k"
tap "sidneys/homebrew"
{{ if .context.machine.personal -}}
tap "twilio/brew"
{{- end }}

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Formulae (brew install)
brew "age"
brew "bat"
brew "bat-extras"
brew "chezmoi"
brew "croc"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "ffuf"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "go"
brew "gopass"
brew "htop"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "mas"
{{ if .context.machine.personal -}}
brew "mistertea/et/et"
{{ end -}}
brew "moreutils" # sponge, parallel
brew "mosh"
brew "mtr"
brew "naabu"
brew "ncdu"
brew "nmap"
brew "nuclei"
brew "openssh"
brew "pinentry-mac"
brew "pipx"
brew "pre-commit"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rclone"
brew "ripgrep"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "sevenzip"
brew "sipcalc"
brew "speedtest-cli"
brew "terraform"
brew "tflint"
brew "tmux"
brew "twilio/brew/twilio"
brew "virtualenv"
brew "wget"
brew "ykman"
brew "yq"
brew "zsh"

# Formulae (brew install) - explicit/fully qualified taps
brew "knqyf263/pet/pet"

# Casks (brew install --cask)
{{ if .context.machine.personal -}}
cask "1password-cli"
{{ end -}}
cask "github"
cask "iterm2"
cask "keybase"

# Nerd Fonts: https://www.nerdfonts.com/
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"

# Powerline fonts: https://github.com/powerline/fonts
cask "font-anonymice-powerline", args: { require_sha: false }
cask "font-consolas-for-powerline", args: { require_sha: false }
cask "font-dejavu-sans-mono-for-powerline", args: { require_sha: false }
cask "font-delugia-mono-powerline"
cask "font-delugia-powerline"
cask "font-droid-sans-mono-for-powerline", args: { require_sha: false }
cask "font-fira-mono-for-powerline", args: { require_sha: false }
cask "font-inconsolata-dz-for-powerline", args: { require_sha: false }
cask "font-inconsolata-for-powerline", args: { require_sha: false }
cask "font-inconsolata-for-powerline-bold", args: { require_sha: false }
cask "font-inconsolata-g-for-powerline", args: { require_sha: false }
cask "font-liberation-mono-for-powerline", args: { require_sha: false }
cask "font-menlo-for-powerline", args: { require_sha: false }
cask "font-monofur-for-powerline", args: { require_sha: false }
cask "font-noto-mono-for-powerline", args: { require_sha: false }
cask "font-powerline-symbols", args: { require_sha: false }
cask "font-roboto-mono-for-powerline", args: { require_sha: false }
cask "font-sf-mono-for-powerline", args: { require_sha: false }
cask "font-source-code-pro-for-powerline", args: { require_sha: false }
cask "font-ubuntu-mono-derivative-powerline", args: { require_sha: false }

# Mac App Store Apps (mas install)

# Whalebrew containerized apps (whalebrew install)
